app/views/messages/show.html.erb

  <h3 class="my-4">Comments:</h3>
  <% if @message.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = ?  [["message_id", 5]]
SELECT 1 AS one FROM "comments" WHERE "comments"."message_id" = ? LIMIT ?  [["message_id", 2], ["LIMIT", 1]]