app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "kajdlkasmd"], ["message_id", 6], ["user_id", 7], ["created_at", "2024-08-06 09:16:07.258884"], ["updated_at", "2024-08-06 09:16:07.258884"]]
---
    def create
        @comment = @message.comments.build(comment_params)
       if @comment.user_id = current_user.id

        if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "hhhhhhhhhhhhhhhhhhhhhhhn"], ["updated_at", "2024-08-06 07:50:30.868420"], ["id", 12]]
---
      def update
        if @comment.update(comment_params)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def find_message
        @message=Message.find(params[:message_id])

SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT ?  [["message_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def find_comment
        @comment=@message.comments.find(params[:id])