app/controllers/messages_controller.rb

    def index
        @messages=Message.all.order("created_at DESC")
---
SELECT "messages".* FROM "messages" ORDER BY created_at DESC

    def create
        @message=current_user.messages.build(message_params)
        if @message.save
---
INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "RB Home"], ["description", "Family is home"], ["created_at", "2024-08-06 09:15:29.018074"], ["updated_at", "2024-08-06 09:15:29.018074"], ["user_id", 7]]

    def find_message
        @message=Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        if @message.update(message_params)
---
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "saasdadsasas"], ["updated_at", "2024-08-06 07:01:42.001158"], ["id", 3]]

    def destroy
        @message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 2]]